Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON1.h
/*! @name NMISRC - NMI Source Select */
/*! @{ */

#define SYSCON1_NMISRC_IRQCPU1_MASK              (0xFFU)
#define SYSCON1_NMISRC_IRQCPU1_SHIFT             (0U)
/*! IRQCPU1 - The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) for CPU1, if enabled by NMIENCPU1 */
#define SYSCON1_NMISRC_IRQCPU1(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON1_NMISRC_IRQCPU1_SHIFT)) & SYSCON1_NMISRC_IRQCPU1_MASK)

#define SYSCON1_NMISRC_NMIENCPU1_MASK            (0x80000000U)
#define SYSCON1_NMISRC_NMIENCPU1_SHIFT           (31U)
/*! NMIENCPU1 - Enables the Non-Maskable Interrupt (NMI) source selected by IRQCPU1
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_NMISRC_NMIENCPU1(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON1_NMISRC_NMIENCPU1_SHIFT)) & SYSCON1_NMISRC_NMIENCPU1_MASK)
/*! @} */

/*! @name CTIMERGLOBALSTARTEN - CTIMER Global Start Enable */
/*! @{ */

#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_MASK (0x1U)
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_SHIFT (0U)
/*! CTIMER0_CLK_EN - CTIMER5 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_SHIFT)) & SYSCON1_CTIMERGLOBALSTARTEN_CTIMER0_CLK_EN_MASK)

#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_MASK (0x2U)
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_SHIFT (1U)
/*! CTIMER1_CLK_EN - CTIMER6 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_SHIFT)) & SYSCON1_CTIMERGLOBALSTARTEN_CTIMER1_CLK_EN_MASK)

#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_MASK (0x4U)
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_SHIFT (2U)
/*! CTIMER2_CLK_EN - CTIMER7 Function Clock Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_SHIFT)) & SYSCON1_CTIMERGLOBALSTARTEN_CTIMER2_CLK_EN_MASK)
/*! @} */

/*! @name AHBMATPRIO - Bus Matrix Priority */
/*! @{ */

#define SYSCON1_AHBMATPRIO_SBUS_M0_MASK          (0x3U)
#define SYSCON1_AHBMATPRIO_SBUS_M0_SHIFT         (0U)
/*! SBUS_M0 - S-Bus M0 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M0(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M0_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M0_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M1_MASK          (0xCU)
#define SYSCON1_AHBMATPRIO_SBUS_M1_SHIFT         (2U)
/*! SBUS_M1 - S-Bus M1 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M1(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M1_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M1_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M2_MASK          (0x30U)
#define SYSCON1_AHBMATPRIO_SBUS_M2_SHIFT         (4U)
/*! SBUS_M2 - S-Bus M2 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M2(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M2_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M2_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M3_MASK          (0xC0U)
#define SYSCON1_AHBMATPRIO_SBUS_M3_SHIFT         (6U)
/*! SBUS_M3 - S-Bus M3 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M3(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M3_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M3_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M4_MASK          (0x300U)
#define SYSCON1_AHBMATPRIO_SBUS_M4_SHIFT         (8U)
/*! SBUS_M4 - S-Bus M4 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M4(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M4_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M4_MASK)

#define SYSCON1_AHBMATPRIO_SBUS_M5_MASK          (0xC00U)
#define SYSCON1_AHBMATPRIO_SBUS_M5_SHIFT         (10U)
/*! SBUS_M5 - S-Bus M5 Priority
 *  0b00..Level 0
 *  0b01..Level 1
 *  0b10..Level 2
 *  0b11..Level 3
 */
#define SYSCON1_AHBMATPRIO_SBUS_M5(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON1_AHBMATPRIO_SBUS_M5_SHIFT)) & SYSCON1_AHBMATPRIO_SBUS_M5_MASK)
/*! @} */

/*! @name SYSTEM_STICK_CALIB - System Secure Tick Calibration */
/*! @{ */

#define SYSCON1_SYSTEM_STICK_CALIB_TENMS_MASK    (0xFFFFFFU)
#define SYSCON1_SYSTEM_STICK_CALIB_TENMS_SHIFT   (0U)
/*! TENMS - Ten Milliseconds */
#define SYSCON1_SYSTEM_STICK_CALIB_TENMS(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_SYSTEM_STICK_CALIB_TENMS_SHIFT)) & SYSCON1_SYSTEM_STICK_CALIB_TENMS_MASK)

#define SYSCON1_SYSTEM_STICK_CALIB_SKEW_MASK     (0x1000000U)
#define SYSCON1_SYSTEM_STICK_CALIB_SKEW_SHIFT    (24U)
/*! SKEW - SKEW
 *  0b0..Exact
 *  0b1..Inexact, or not given
 */
#define SYSCON1_SYSTEM_STICK_CALIB_SKEW(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_SYSTEM_STICK_CALIB_SKEW_SHIFT)) & SYSCON1_SYSTEM_STICK_CALIB_SKEW_MASK)

#define SYSCON1_SYSTEM_STICK_CALIB_NOREF_MASK    (0x2000000U)
#define SYSCON1_SYSTEM_STICK_CALIB_NOREF_SHIFT   (25U)
/*! NOREF - No Reference Clock
 *  0b0..Provides
 *  0b1..Not provide
 */
#define SYSCON1_SYSTEM_STICK_CALIB_NOREF(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_SYSTEM_STICK_CALIB_NOREF_SHIFT)) & SYSCON1_SYSTEM_STICK_CALIB_NOREF_MASK)
/*! @} */

/*! @name SYSTEM_NSTICK_CALIB - System Non-Secure Tick Calibration */
/*! @{ */

#define SYSCON1_SYSTEM_NSTICK_CALIB_TENMS_MASK   (0xFFFFFFU)
#define SYSCON1_SYSTEM_NSTICK_CALIB_TENMS_SHIFT  (0U)
/*! TENMS - Ten Milliseconds */
#define SYSCON1_SYSTEM_NSTICK_CALIB_TENMS(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON1_SYSTEM_NSTICK_CALIB_TENMS_SHIFT)) & SYSCON1_SYSTEM_NSTICK_CALIB_TENMS_MASK)

#define SYSCON1_SYSTEM_NSTICK_CALIB_SKEW_MASK    (0x1000000U)
#define SYSCON1_SYSTEM_NSTICK_CALIB_SKEW_SHIFT   (24U)
/*! SKEW - SKEW
 *  0b0..Exact
 *  0b1..Inexact, or not given
 */
#define SYSCON1_SYSTEM_NSTICK_CALIB_SKEW(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_SYSTEM_NSTICK_CALIB_SKEW_SHIFT)) & SYSCON1_SYSTEM_NSTICK_CALIB_SKEW_MASK)

#define SYSCON1_SYSTEM_NSTICK_CALIB_NOREF_MASK   (0x2000000U)
#define SYSCON1_SYSTEM_NSTICK_CALIB_NOREF_SHIFT  (25U)
/*! NOREF - No Reference Clock
 *  0b0..Provides
 *  0b1..Not provide
 */
#define SYSCON1_SYSTEM_NSTICK_CALIB_NOREF(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON1_SYSTEM_NSTICK_CALIB_NOREF_SHIFT)) & SYSCON1_SYSTEM_NSTICK_CALIB_NOREF_MASK)
/*! @} */

/*! @name GPIO_PSYNC - GPIO Synchronization Stages */
/*! @{ */

#define SYSCON1_GPIO_PSYNC_PSYNC_MASK            (0x1U)
#define SYSCON1_GPIO_PSYNC_PSYNC_SHIFT           (0U)
/*! PSYNC - Synchronization Stage Setting
 *  0b0..2-stage sync
 *  0b1..1-stage sync
 */
#define SYSCON1_GPIO_PSYNC_PSYNC(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON1_GPIO_PSYNC_PSYNC_SHIFT)) & SYSCON1_GPIO_PSYNC_PSYNC_MASK)
/*! @} */

/*! @name EDMA2_MEM_CTRL - eDMA2 Memory Control */
/*! @{ */

#define SYSCON1_EDMA2_MEM_CTRL_PWR_STDBY_MASK    (0x80U)
#define SYSCON1_EDMA2_MEM_CTRL_PWR_STDBY_SHIFT   (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON1_EDMA2_MEM_CTRL_PWR_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON1_EDMA2_MEM_CTRL_PWR_STDBY_MASK)

