Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON1.h
#define SYSCON1_EDMA2_MEM_CTRL_PWR_IG_MASK       (0x100U)
#define SYSCON1_EDMA2_MEM_CTRL_PWR_IG_SHIFT      (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON1_EDMA2_MEM_CTRL_PWR_IG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON1_EDMA2_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name EDMA3_MEM_CTRL - eDMA3 Memory Control */
/*! @{ */

#define SYSCON1_EDMA3_MEM_CTRL_PWR_STDBY_MASK    (0x80U)
#define SYSCON1_EDMA3_MEM_CTRL_PWR_STDBY_SHIFT   (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON1_EDMA3_MEM_CTRL_PWR_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON1_EDMA3_MEM_CTRL_PWR_STDBY_MASK)

#define SYSCON1_EDMA3_MEM_CTRL_PWR_IG_MASK       (0x100U)
#define SYSCON1_EDMA3_MEM_CTRL_PWR_IG_SHIFT      (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON1_EDMA3_MEM_CTRL_PWR_IG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON1_EDMA3_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name SAI3_MCLK_CTRL - SAI3 MCLK IO Direction Control */
/*! @{ */

#define SYSCON1_SAI3_MCLK_CTRL_SAIMCLKDIR_MASK   (0x1U)
#define SYSCON1_SAI3_MCLK_CTRL_SAIMCLKDIR_SHIFT  (0U)
/*! SAIMCLKDIR - SAI3 MCLK Direction Control
 *  0b0..Input
 *  0b1..Output
 */
#define SYSCON1_SAI3_MCLK_CTRL_SAIMCLKDIR(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON1_SAI3_MCLK_CTRL_SAIMCLKDIR_SHIFT)) & SYSCON1_SAI3_MCLK_CTRL_SAIMCLKDIR_MASK)
/*! @} */

/*! @name SENSE_DEBUG_HALTED_SEL - VDD1_SENSE Debug Halted Select */
/*! @{ */

#define SYSCON1_SENSE_DEBUG_HALTED_SEL_WWDT3_SEL_MASK (0x1U)
#define SYSCON1_SENSE_DEBUG_HALTED_SEL_WWDT3_SEL_SHIFT (0U)
/*! WWDT3_SEL - WWDT3 Select
 *  0b0..XOCD mode from HiFi1 will be used for WWDT3
 *  0b1..HALTED from CPU1 will be used for WWDT3
 */
#define SYSCON1_SENSE_DEBUG_HALTED_SEL_WWDT3_SEL(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_SENSE_DEBUG_HALTED_SEL_WWDT3_SEL_SHIFT)) & SYSCON1_SENSE_DEBUG_HALTED_SEL_WWDT3_SEL_MASK)

#define SYSCON1_SENSE_DEBUG_HALTED_SEL_CDOG4_SEL_MASK (0x2U)
#define SYSCON1_SENSE_DEBUG_HALTED_SEL_CDOG4_SEL_SHIFT (1U)
/*! CDOG4_SEL - CDOG4 Select
 *  0b0..XOCD mode from HiFi1 will be used for CDOG4
 *  0b1..HALTED from CPU1 will be used for CDOG4
 */
#define SYSCON1_SENSE_DEBUG_HALTED_SEL_CDOG4_SEL(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_SENSE_DEBUG_HALTED_SEL_CDOG4_SEL_SHIFT)) & SYSCON1_SENSE_DEBUG_HALTED_SEL_CDOG4_SEL_MASK)
/*! @} */

/*! @name DSPSTALL - HiFi1 DSP Stall */
/*! @{ */

#define SYSCON1_DSPSTALL_DSPSTALL_MASK           (0x1U)
#define SYSCON1_DSPSTALL_DSPSTALL_SHIFT          (0U)
/*! DSPSTALL - Run/Stall Control
 *  0b0..Run (normal mode)
 *  0b1..Stall mode
 */
#define SYSCON1_DSPSTALL_DSPSTALL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON1_DSPSTALL_DSPSTALL_SHIFT)) & SYSCON1_DSPSTALL_DSPSTALL_MASK)
/*! @} */

/*! @name OCDHALTONRESET - HiFi1 OCDHaltOnReset */
/*! @{ */

#define SYSCON1_OCDHALTONRESET_OCDHALTONRESET_MASK (0x1U)
#define SYSCON1_OCDHALTONRESET_OCDHALTONRESET_SHIFT (0U)
/*! OCDHALTONRESET - OCDHaltOnReset
 *  0b0..Allow normal operation when HiFi1 exits reset (starts fetching and executing instructions from memory)
 *  0b1..Force HiFi1 to enter OCD Halt mode when HiFi1 exits reset
 */
#define SYSCON1_OCDHALTONRESET_OCDHALTONRESET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_OCDHALTONRESET_OCDHALTONRESET_SHIFT)) & SYSCON1_OCDHALTONRESET_OCDHALTONRESET_MASK)
/*! @} */

/*! @name HIFI1_GPR0 - HiFi1 General Purpose Register 0 */
/*! @{ */

#define SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_MASK    (0x1U)
#define SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_SHIFT   (0U)
/*! PFAULTINFOVLD - PFaultInfoValid
 *  0b0..Not asserted
 *  0b1..Asserted
 */
#define SYSCON1_HIFI1_GPR0_PFAULTINFOVLD(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_SHIFT)) & SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_MASK)

#define SYSCON1_HIFI1_GPR0_PFATALERR_MASK        (0x2U)
#define SYSCON1_HIFI1_GPR0_PFATALERR_SHIFT       (1U)
/*! PFATALERR - PFatalError
 *  0b0..No error occurs
 *  0b1..Error occurs
 */
#define SYSCON1_HIFI1_GPR0_PFATALERR(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR0_PFATALERR_SHIFT)) & SYSCON1_HIFI1_GPR0_PFATALERR_MASK)

#define SYSCON1_HIFI1_GPR0_EXCEPTIONERR_MASK     (0x4U)
#define SYSCON1_HIFI1_GPR0_EXCEPTIONERR_SHIFT    (2U)
/*! EXCEPTIONERR - DoubleExceptionError
 *  0b0..No error occurs
 *  0b1..Error occurs
 */
#define SYSCON1_HIFI1_GPR0_EXCEPTIONERR(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR0_EXCEPTIONERR_SHIFT)) & SYSCON1_HIFI1_GPR0_EXCEPTIONERR_MASK)
/*! @} */

/*! @name HIFI1_GPR1 - HiFi1 General Purpose Register 1 */
/*! @{ */

#define SYSCON1_HIFI1_GPR1_PFAULTINFO_MASK       (0xFFFFFFFFU)
#define SYSCON1_HIFI1_GPR1_PFAULTINFO_SHIFT      (0U)
/*! PFAULTINFO - PFaultInfo */
#define SYSCON1_HIFI1_GPR1_PFAULTINFO(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR1_PFAULTINFO_SHIFT)) & SYSCON1_HIFI1_GPR1_PFAULTINFO_MASK)
/*! @} */

/*! @name HIFI1_GPR2 - HiFi1 General Purpose Register 2 */
/*! @{ */

#define SYSCON1_HIFI1_GPR2_TIE_EXPSTATE_MASK     (0xFFFFFFFFU)
#define SYSCON1_HIFI1_GPR2_TIE_EXPSTATE_SHIFT    (0U)
/*! TIE_EXPSTATE - GPIO32 Option TIE Output State */
#define SYSCON1_HIFI1_GPR2_TIE_EXPSTATE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR2_TIE_EXPSTATE_SHIFT)) & SYSCON1_HIFI1_GPR2_TIE_EXPSTATE_MASK)
/*! @} */

/*! @name DSP_VECT_REMAP - HiFi1 DSP Vector Remap */
/*! @{ */

#define SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_MASK (0xFFFU)
#define SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_SHIFT (0U)
/*! DSP_VECT_REMAP - DSP Vector Remap */
#define SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_SHIFT)) & SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_MASK)

#define SYSCON1_DSP_VECT_REMAP_STATVECSELECT_MASK (0x1000U)
#define SYSCON1_DSP_VECT_REMAP_STATVECSELECT_SHIFT (12U)
/*! STATVECSELECT - Static Vector Select
 *  0b0..Selects the primary static vector address (0058_0000h)
 *  0b1..No effect
 */
#define SYSCON1_DSP_VECT_REMAP_STATVECSELECT(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON1_DSP_VECT_REMAP_STATVECSELECT_SHIFT)) & SYSCON1_DSP_VECT_REMAP_STATVECSELECT_MASK)
/*! @} */

/*! @name EDMA2_EN0 - eDMA2 Request Enable 0 */
/*! @{ */

#define SYSCON1_EDMA2_EN0_MICFIL_EN_MASK         (0x2U)
#define SYSCON1_EDMA2_EN0_MICFIL_EN_SHIFT        (1U)
/*! MICFIL_EN - MICFIL Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_MICFIL_EN(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_MICFIL_EN_SHIFT)) & SYSCON1_EDMA2_EN0_MICFIL_EN_MASK)

#define SYSCON1_EDMA2_EN0_XSPI2_RX_EN_MASK       (0x4U)
#define SYSCON1_EDMA2_EN0_XSPI2_RX_EN_SHIFT      (2U)
/*! XSPI2_RX_EN - XSPI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_XSPI2_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_XSPI2_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN0_XSPI2_RX_EN_MASK)

