Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON1.h
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_MASK (0x800000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_SHIFT (23U)
/*! FLEXIO_SHFT_TIMER0_EN - FLEXIO Shift Timer 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_MASK (0x1000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_SHIFT (24U)
/*! FLEXIO_SHFT_TIMER1_EN - FLEXIO Shift Timer 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_MASK (0x2000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_SHIFT (25U)
/*! FLEXIO_SHFT_TIMER2_EN - FLEXIO Shift Timer 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_MASK (0x4000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_SHIFT (26U)
/*! FLEXIO_SHFT_TIMER3_EN - FLEXIO Shift Timer 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_MASK (0x8000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_SHIFT (27U)
/*! FLEXIO_SHFT_TIMER4_EN - FLEXIO Shift Timer 4 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_MASK (0x10000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_SHIFT (28U)
/*! FLEXIO_SHFT_TIMER5_EN - FLEXIO Shift Timer 5 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_MASK (0x20000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_SHIFT (29U)
/*! FLEXIO_SHFT_TIMER6_EN - FLEXIO Shift Timer 6 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_MASK (0x40000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_SHIFT (30U)
/*! FLEXIO_SHFT_TIMER7_EN - FLEXIO Shift Timer 7 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_MASK)

#define SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_MASK (0x80000000U)
#define SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_SHIFT (31U)
/*! LP_FLEXCOMM17_RX_EN - LP_FLEXCOMM17 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_MASK)
/*! @} */

/*! @name EDMA2_EN1 - eDMA2 Request Enable 1 */
/*! @{ */

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM17_TX_EN_MASK (0x1U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM17_TX_EN_SHIFT (0U)
/*! LP_FLEXCOMM17_TX_EN - LP_FLEXCOMM17 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM17_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM17_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM17_TX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_RX_EN_MASK (0x2U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_RX_EN_SHIFT (1U)
/*! LP_FLEXCOMM18_RX_EN - LP_FLEXCOMM18 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_TX_EN_MASK (0x4U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_TX_EN_SHIFT (2U)
/*! LP_FLEXCOMM18_TX_EN - LP_FLEXCOMM18 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM18_TX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_RX_EN_MASK (0x8U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_RX_EN_SHIFT (3U)
/*! LP_FLEXCOMM19_RX_EN - LP_FLEXCOMM19 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_TX_EN_MASK (0x10U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_TX_EN_SHIFT (4U)
/*! LP_FLEXCOMM19_TX_EN - LP_FLEXCOMM19 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM19_TX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_RX_EN_MASK (0x20U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_RX_EN_SHIFT (5U)
/*! LP_FLEXCOMM20_RX_EN - LP_FLEXCOMM20 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_TX_EN_MASK (0x40U)
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_TX_EN_SHIFT (6U)
/*! LP_FLEXCOMM20_TX_EN - LP_FLEXCOMM20 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LP_FLEXCOMM20_TX_EN_MASK)

