Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON1.h
#define SYSCON1_EDMA2_EN1_I3C2_RX_EN_MASK        (0x80U)
#define SYSCON1_EDMA2_EN1_I3C2_RX_EN_SHIFT       (7U)
/*! I3C2_RX_EN - I3C2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_I3C2_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_I3C2_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_I3C2_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_I3C2_TX_EN_MASK        (0x100U)
#define SYSCON1_EDMA2_EN1_I3C2_TX_EN_SHIFT       (8U)
/*! I3C2_TX_EN - I3C2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_I3C2_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_I3C2_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_I3C2_TX_EN_MASK)

#define SYSCON1_EDMA2_EN1_I3C3_RX_EN_MASK        (0x200U)
#define SYSCON1_EDMA2_EN1_I3C3_RX_EN_SHIFT       (9U)
/*! I3C3_RX_EN - I3C3 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_I3C3_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_I3C3_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_I3C3_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_I3C3_TX_EN_MASK        (0x400U)
#define SYSCON1_EDMA2_EN1_I3C3_TX_EN_SHIFT       (10U)
/*! I3C3_TX_EN - I3C3 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_I3C3_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_I3C3_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_I3C3_TX_EN_MASK)

#define SYSCON1_EDMA2_EN1_SAI3_RX_EN_MASK        (0x800U)
#define SYSCON1_EDMA2_EN1_SAI3_RX_EN_SHIFT       (11U)
/*! SAI3_RX_EN - SAI3 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_SAI3_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_SAI3_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_SAI3_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_SAI3_TX_EN_MASK        (0x1000U)
#define SYSCON1_EDMA2_EN1_SAI3_TX_EN_SHIFT       (12U)
/*! SAI3_TX_EN - SAI3 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_SAI3_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_SAI3_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_SAI3_TX_EN_MASK)

#define SYSCON1_EDMA2_EN1_GPIO8_DMA0_EN_MASK     (0x2000U)
#define SYSCON1_EDMA2_EN1_GPIO8_DMA0_EN_SHIFT    (13U)
/*! GPIO8_DMA0_EN - GPIO8 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_GPIO8_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_GPIO8_DMA0_EN_SHIFT)) & SYSCON1_EDMA2_EN1_GPIO8_DMA0_EN_MASK)

#define SYSCON1_EDMA2_EN1_GPIO8_DMA1_EN_MASK     (0x4000U)
#define SYSCON1_EDMA2_EN1_GPIO8_DMA1_EN_SHIFT    (14U)
/*! GPIO8_DMA1_EN - GPIO8 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_GPIO8_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_GPIO8_DMA1_EN_SHIFT)) & SYSCON1_EDMA2_EN1_GPIO8_DMA1_EN_MASK)

#define SYSCON1_EDMA2_EN1_GPIO9_DMA0_EN_MASK     (0x8000U)
#define SYSCON1_EDMA2_EN1_GPIO9_DMA0_EN_SHIFT    (15U)
/*! GPIO9_DMA0_EN - GPIO9 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_GPIO9_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_GPIO9_DMA0_EN_SHIFT)) & SYSCON1_EDMA2_EN1_GPIO9_DMA0_EN_MASK)

#define SYSCON1_EDMA2_EN1_GPIO9_DMA1_EN_MASK     (0x10000U)
#define SYSCON1_EDMA2_EN1_GPIO9_DMA1_EN_SHIFT    (16U)
/*! GPIO9_DMA1_EN - GPIO9 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_GPIO9_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_GPIO9_DMA1_EN_SHIFT)) & SYSCON1_EDMA2_EN1_GPIO9_DMA1_EN_MASK)

#define SYSCON1_EDMA2_EN1_GPIO10_DMA0_EN_MASK    (0x20000U)
#define SYSCON1_EDMA2_EN1_GPIO10_DMA0_EN_SHIFT   (17U)
/*! GPIO10_DMA0_EN - GPIO10 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_GPIO10_DMA0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_GPIO10_DMA0_EN_SHIFT)) & SYSCON1_EDMA2_EN1_GPIO10_DMA0_EN_MASK)

#define SYSCON1_EDMA2_EN1_GPIO10_DMA1_EN_MASK    (0x40000U)
#define SYSCON1_EDMA2_EN1_GPIO10_DMA1_EN_SHIFT   (18U)
/*! GPIO10_DMA1_EN - GPIO10 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_GPIO10_DMA1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_GPIO10_DMA1_EN_SHIFT)) & SYSCON1_EDMA2_EN1_GPIO10_DMA1_EN_MASK)

#define SYSCON1_EDMA2_EN1_LPI2C15_RX_EN_MASK     (0x80000U)
#define SYSCON1_EDMA2_EN1_LPI2C15_RX_EN_SHIFT    (19U)
/*! LPI2C15_RX_EN - LPI2C15 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LPI2C15_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LPI2C15_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LPI2C15_RX_EN_MASK)

#define SYSCON1_EDMA2_EN1_LPI2C15_TX_EN_MASK     (0x100000U)
#define SYSCON1_EDMA2_EN1_LPI2C15_TX_EN_SHIFT    (20U)
/*! LPI2C15_TX_EN - LPI2C15 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN1_LPI2C15_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN1_LPI2C15_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN1_LPI2C15_TX_EN_MASK)
/*! @} */

/*! @name EDMA3_EN0 - eDMA3 Request Enable 0 */
/*! @{ */

#define SYSCON1_EDMA3_EN0_MICFIL_EN_MASK         (0x2U)
#define SYSCON1_EDMA3_EN0_MICFIL_EN_SHIFT        (1U)
/*! MICFIL_EN - MICFIL Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_MICFIL_EN(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_MICFIL_EN_SHIFT)) & SYSCON1_EDMA3_EN0_MICFIL_EN_MASK)

#define SYSCON1_EDMA3_EN0_XSPI2_RX_EN_MASK       (0x4U)
#define SYSCON1_EDMA3_EN0_XSPI2_RX_EN_SHIFT      (2U)
/*! XSPI2_RX_EN - XSPI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_XSPI2_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_XSPI2_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN0_XSPI2_RX_EN_MASK)

#define SYSCON1_EDMA3_EN0_XSPI2_TX_EN_MASK       (0x8U)
#define SYSCON1_EDMA3_EN0_XSPI2_TX_EN_SHIFT      (3U)
/*! XSPI2_TX_EN - XSPI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_XSPI2_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_XSPI2_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN0_XSPI2_TX_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_MASK     (0x10U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_SHIFT    (4U)
/*! PINT1_IRQ0_EN - PINT1 Interrupt 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_MASK     (0x20U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_SHIFT    (5U)
/*! PINT1_IRQ1_EN - PINT1 Interrupt 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_MASK     (0x40U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_SHIFT    (6U)
/*! PINT1_IRQ2_EN - PINT1 Interrupt 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_MASK     (0x80U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_SHIFT    (7U)
/*! PINT1_IRQ3_EN - PINT1 Interrupt 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_MASK     (0x100U)
#define SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_SHIFT    (8U)
/*! CTIMER5_M0_EN - CTIMER5 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER5_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_MASK     (0x200U)
#define SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_SHIFT    (9U)
/*! CTIMER5_M1_EN - CTIMER5 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER5_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_MASK)

