Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON1.h
#define SYSCON1_EDMA3_EN0_LP_FLEXCOMM17_RX_EN_MASK (0x80000000U)
#define SYSCON1_EDMA3_EN0_LP_FLEXCOMM17_RX_EN_SHIFT (31U)
/*! LP_FLEXCOMM17_RX_EN - LP_FLEXCOMM17 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_LP_FLEXCOMM17_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_LP_FLEXCOMM17_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN0_LP_FLEXCOMM17_RX_EN_MASK)
/*! @} */

/*! @name EDMA3_EN1 - eDMA3 Request Enable 1 */
/*! @{ */

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM17_TX_EN_MASK (0x1U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM17_TX_EN_SHIFT (0U)
/*! LP_FLEXCOMM17_TX_EN - LP_FLEXCOMM17 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM17_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM17_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM17_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_RX_EN_MASK (0x2U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_RX_EN_SHIFT (1U)
/*! LP_FLEXCOMM18_RX_EN - LP_FLEXCOMM18 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_TX_EN_MASK (0x4U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_TX_EN_SHIFT (2U)
/*! LP_FLEXCOMM18_TX_EN - LP_FLEXCOMM18 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM18_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_RX_EN_MASK (0x8U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_RX_EN_SHIFT (3U)
/*! LP_FLEXCOMM19_RX_EN - LP_FLEXCOMM19 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_TX_EN_MASK (0x10U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_TX_EN_SHIFT (4U)
/*! LP_FLEXCOMM19_TX_EN - LP_FLEXCOMM19 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM19_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_RX_EN_MASK (0x20U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_RX_EN_SHIFT (5U)
/*! LP_FLEXCOMM20_RX_EN - LP_FLEXCOMM20 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_TX_EN_MASK (0x40U)
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_TX_EN_SHIFT (6U)
/*! LP_FLEXCOMM20_TX_EN - LP_FLEXCOMM20 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LP_FLEXCOMM20_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_I3C2_RX_EN_MASK        (0x80U)
#define SYSCON1_EDMA3_EN1_I3C2_RX_EN_SHIFT       (7U)
/*! I3C2_RX_EN - I3C2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_I3C2_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_I3C2_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_I3C2_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_I3C2_TX_EN_MASK        (0x100U)
#define SYSCON1_EDMA3_EN1_I3C2_TX_EN_SHIFT       (8U)
/*! I3C2_TX_EN - I3C2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_I3C2_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_I3C2_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_I3C2_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_I3C3_RX_EN_MASK        (0x200U)
#define SYSCON1_EDMA3_EN1_I3C3_RX_EN_SHIFT       (9U)
/*! I3C3_RX_EN - I3C3 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_I3C3_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_I3C3_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_I3C3_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_I3C3_TX_EN_MASK        (0x400U)
#define SYSCON1_EDMA3_EN1_I3C3_TX_EN_SHIFT       (10U)
/*! I3C3_TX_EN - I3C3 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_I3C3_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_I3C3_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_I3C3_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_SAI3_RX_EN_MASK        (0x800U)
#define SYSCON1_EDMA3_EN1_SAI3_RX_EN_SHIFT       (11U)
/*! SAI3_RX_EN - SAI3 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_SAI3_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_SAI3_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_SAI3_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_SAI3_TX_EN_MASK        (0x1000U)
#define SYSCON1_EDMA3_EN1_SAI3_TX_EN_SHIFT       (12U)
/*! SAI3_TX_EN - SAI3 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_SAI3_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_SAI3_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_SAI3_TX_EN_MASK)

#define SYSCON1_EDMA3_EN1_GPIO8_DMA0_EN_MASK     (0x2000U)
#define SYSCON1_EDMA3_EN1_GPIO8_DMA0_EN_SHIFT    (13U)
/*! GPIO8_DMA0_EN - GPIO8 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_GPIO8_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_GPIO8_DMA0_EN_SHIFT)) & SYSCON1_EDMA3_EN1_GPIO8_DMA0_EN_MASK)

#define SYSCON1_EDMA3_EN1_GPIO8_DMA1_EN_MASK     (0x4000U)
#define SYSCON1_EDMA3_EN1_GPIO8_DMA1_EN_SHIFT    (14U)
/*! GPIO8_DMA1_EN - GPIO8 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_GPIO8_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_GPIO8_DMA1_EN_SHIFT)) & SYSCON1_EDMA3_EN1_GPIO8_DMA1_EN_MASK)

#define SYSCON1_EDMA3_EN1_GPIO9_DMA0_EN_MASK     (0x8000U)
#define SYSCON1_EDMA3_EN1_GPIO9_DMA0_EN_SHIFT    (15U)
/*! GPIO9_DMA0_EN - GPIO9 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_GPIO9_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_GPIO9_DMA0_EN_SHIFT)) & SYSCON1_EDMA3_EN1_GPIO9_DMA0_EN_MASK)

#define SYSCON1_EDMA3_EN1_GPIO9_DMA1_EN_MASK     (0x10000U)
#define SYSCON1_EDMA3_EN1_GPIO9_DMA1_EN_SHIFT    (16U)
/*! GPIO9_DMA1_EN - GPIO9 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_GPIO9_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_GPIO9_DMA1_EN_SHIFT)) & SYSCON1_EDMA3_EN1_GPIO9_DMA1_EN_MASK)

