Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON1.h
#define SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_MASK    (0x20000U)
#define SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_SHIFT   (17U)
/*! RGPI10_DMA0_EN - GPIO10 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_SHIFT)) & SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_MASK)

#define SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_MASK    (0x40000U)
#define SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_SHIFT   (18U)
/*! RGPI10_DMA1_EN - GPIO10 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_SHIFT)) & SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_MASK)

#define SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_MASK     (0x80000U)
#define SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_SHIFT    (19U)
/*! LPI2C15_RX_EN - LPI2C15 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LPI2C15_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_MASK     (0x100000U)
#define SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_SHIFT    (20U)
/*! LPI2C15_TX_EN - LPI2C15 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LPI2C15_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_MASK)
/*! @} */

/*! @name I3C_ASYNC_WAKEUP_CTRL - I3C Asynchronous Wake-up Control */
/*! @{ */

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_MASK (0x1U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_SHIFT (0U)
/*! I3C2_ON_CHIP_STRONG_PULL_DIS - I3C2 On-Chip Strong Pull Disable
 *  0b0..Enables
 *  0b1..Disables
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_MASK)

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_MASK (0x2U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_SHIFT (1U)
/*! IRQ_EN2 - I3C2 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_MASK)

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_MASK (0x100U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_SHIFT (8U)
/*! I3C3_ON_CHIP_STRONG_PULL_DIS - I3C3 On-Chip Strong Pull Disable
 *  0b0..Enables
 *  0b1..Disables
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_MASK)

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_MASK (0x200U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_SHIFT (9U)
/*! IRQ_EN3 - I3C3 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SYSCON1_Register_Masks */


/*!
 * @}
 */ /* end of group SYSCON1_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SYSCON1_H_ */

